ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxL.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x5C</addressOffset>
        <description>"OCU ch.5,4 Connecting FRT Select Register"</description>
        <fields></fields>
        <name>OCU_OCFS54</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>"OCU ch.1,0 Control Register A"</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the operation of OCU ch.(0)</description>
            <name>CST0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the operation of OCU ch.(1)</description>
            <name>CST1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Disables the buffer function of the OCCP(0) register</description>
            <name>BDIS0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Disables the buffer function of the OCCP(1) register</description>
            <name>BDIS1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>"Generates interrupt, when ""1"" is set to OCSA.IOP0"</description>
            <name>IOE0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>"Generates interrupt, when ""1"" is set to OCSA.IOP1"</description>
            <name>IOE1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Indicates that a match has already been detected between FRT's count value and OCCP(0) value at OCU ch.(0). </description>
            <name>IOP0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Indicates that a match has already been detected between FRT's count value and OCCP(1) value at OCU ch.(1).</description>
            <name>IOP1</name>
          </field>
        </fields>
        <name>OCU_OCSA10</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0xC</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1C</addressOffset>
        <description>"OCU ch.3,2 Control Register A"</description>
        <fields></fields>
        <name>OCU_OCSA32</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x20</addressOffset>
        <description>"OCU ch.5,4 Control Register A"</description>
        <fields></fields>
        <name>OCU_OCSA54</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x19</addressOffset>
        <description>"OCU ch.1,0 Control Register B"</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Indicates that the RT(0) output pin is in the High-level output state. </description>
            <name>OTD0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Indicates that the RT(1) output pin is in the High-level output state.</description>
            <name>OTD1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>selects OCU's operation mode in combination with OCSC.MOD0 to MOD5</description>
            <name>CMOD</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Performs buffer transfer of the OCCP(0) register upon Peak value detection by FRT</description>
            <name>BTS0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Performs buffer transfer of the OCCP(1) register upon Peak value detection by FRT</description>
            <name>BTS1</name>
          </field>
        </fields>
        <name>OCU_OCSB10</name>
        <resetMask>0x73</resetMask>
        <resetValue>0x60</resetValue>
        <size>0x8</size>
      </register>
