ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxL.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x70</addressOffset>
        <description>ICU ch.2 Capture value store register</description>
        <fields></fields>
        <name>ICU_ICCP2</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x74</addressOffset>
        <description>ICU ch.3 Capture value store register</description>
        <fields></fields>
        <name>ICU_ICCP3</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xBC</addressOffset>
        <description>ADCMP Control Register A</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>enable or disable the operation of ADCMP-ch.0 and select the FRT to be connected</description>
            <name>CE0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>enable or disable the operation of ADCMP-ch.1 and select the FRT to be connected</description>
            <name>CE1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>enable or disable the operation of ADCMP-ch.2 and select the FRT to be connected</description>
            <name>CE2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>which count state FRT should be in to instruct AD conversion to be started at ADCMP-ch.0</description>
            <name>SEL0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>which count state FRT should be in to instruct AD conversion to be started at ADCMP-ch.1</description>
            <name>SEL1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>which count state FRT should be in to instruct AD conversion to be started at ADCMP-ch.2</description>
            <name>SEL2</name>
          </field>
        </fields>
        <name>ADCMP_ACSA</name>
        <resetMask>0x3F3F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xB8</addressOffset>
        <description>ADCMP Control Register B</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Disables the buffer function of the ACCP0 and ACCPDN0 registers</description>
            <name>BDIS0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Disables the buffer function of the ACCP1 and ACCPDN1 registers</description>
            <name>BDIS1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Disables the buffer function of the ACCP2 and ACCPDN2 registers</description>
            <name>BDIS2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Performs buffer transfer of the ACCP0 and ACCPDN0 registers upon Peak value detection by FRT</description>
            <name>BTS0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Performs buffer transfer of the ACCP1 and ACCPDN1 registers upon Peak value detection by FRT</description>
            <name>BTS1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Performs buffer transfer of the ACCP2 and ACCPDN2 registers upon Peak value detection by FRT</description>
            <name>BTS2</name>
          </field>
        </fields>
        <name>ADCMP_ACSB</name>
        <resetMask>0x77</resetMask>
        <resetValue>0x7</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xA0</addressOffset>
        <description>ADCMP ch.0 Compare Value Store Register</description>
        <fields></fields>
        <name>ADCMP_ACCP0</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xA8</addressOffset>
        <description>ADCMP ch.1 Compare Value Store Register</description>
        <fields></fields>
        <name>ADCMP_ACCP1</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
