ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxL.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x20C</addressOffset>
        <description>PPG1 Reload Registers Low</description>
        <fields></fields>
        <name>PRLL1</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x211</addressOffset>
        <description>PPG2 Reload Registers High</description>
        <fields></fields>
        <name>PRLH2</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x210</addressOffset>
        <description>PPG2 Reload Registers Low</description>
        <fields></fields>
        <name>PRLL2</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x215</addressOffset>
        <description>PPG3 Reload Registers High</description>
        <fields></fields>
        <name>PRLH3</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x214</addressOffset>
        <description>PPG3 Reload Registers Low</description>
        <fields></fields>
        <name>PRLL3</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x249</addressOffset>
        <description>PPG4 Reload Registers High</description>
        <fields></fields>
        <name>PRLH4</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x248</addressOffset>
        <description>PPG4 Reload Registers Low</description>
        <fields></fields>
        <name>PRLL4</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24D</addressOffset>
        <description>PPG5 Reload Registers High</description>
        <fields></fields>
        <name>PRLH5</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24C</addressOffset>
        <description>PPG5 Reload Registers Low</description>
        <fields></fields>
        <name>PRLL5</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x251</addressOffset>
        <description>PPG6 Reload Registers High</description>
        <fields></fields>
        <name>PRLH6</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x250</addressOffset>
        <description>PPG6 Reload Registers Low</description>
        <fields></fields>
        <name>PRLL6</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x255</addressOffset>
        <description>PPG7 Reload Registers High</description>
        <fields></fields>
        <name>PRLH7</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x254</addressOffset>
        <description>PPG7 Reload Registers Low</description>
        <fields></fields>
        <name>PRLL7</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x218</addressOffset>
        <description>PPG Gate Function Control Registers 0</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Select a trigger for PPG2</description>
            <name>STRG2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Select Start Effective Level for PPG2</description>
            <name>EDGE2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Select a trigger for PPG0</description>
            <name>STRG0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Select Start Effective Level for PPG0</description>
            <name>EDGE0</name>
          </field>
        </fields>
        <name>GATEC0</name>
        <resetMask>0x33</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
