ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxL.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>Scan Conversion Input Selection Register 0</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit7 of SCIS0</description>
            <name>AN7</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit6 of SCIS0</description>
            <name>AN6</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit5 of SCIS0</description>
            <name>AN5</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit4 of SCIS0</description>
            <name>AN4</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit3 of SCIS0</description>
            <name>AN3</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit2 of SCIS0</description>
            <name>AN2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit1 of SCIS0</description>
            <name>AN1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit0 of SCIS0</description>
            <name>AN0</name>
          </field>
        </fields>
        <name>SCIS0</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>Priority Conversion FIFO Stage Count Setup Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Test bits</description>
            <name>TEST</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Priority conversion FIFO stage count setting bits </description>
            <name>PFS</name>
          </field>
        </fields>
        <name>PFNS</name>
        <resetMask>0x33</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x19</addressOffset>
        <description>Priority Conversion Control Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Priority conversion FIFO empty bit</description>
            <name>PEMP</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Priority conversion FIFO full bit </description>
            <name>PFUL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Priority conversion overrun flag</description>
            <name>POVR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Priority conversion FIFO clear bit </description>
            <name>PFCLR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>External trigger analog input selection bit </description>
            <name>ESCE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Priority conversion external start enable bit </description>
            <name>PEEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Priority conversion timer start enable bit </description>
            <name>PHEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Priority conversion start bit </description>
            <name>PSTR</name>
          </field>
        </fields>
        <name>PCCR</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x80</resetValue>
        <size>0x8</size>
      </register>
