ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxL.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x30</addressOffset>
        <description>Sampling Time Setup Register 1</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Sampling time N times setting bits</description>
            <name>STX1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Sampling time setting bits</description>
            <name>ST1</name>
          </field>
        </fields>
        <name>ADST1</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x10</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x31</addressOffset>
        <description>Sampling Time Setup Register 0</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Sampling time N times setting bits </description>
            <name>STX0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Sampling time setting bits</description>
            <name>ST0</name>
          </field>
        </fields>
        <name>ADST0</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x10</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x34</addressOffset>
        <description>Comparison Time Setup Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Compare clock frequency division ratio setting bits</description>
            <name>CT</name>
          </field>
        </fields>
        <name>ADCT</name>
        <resetMask>0x7</resetMask>
        <resetValue>0x7</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x38</addressOffset>
        <description>Priority Conversion Timer Trigger Selection Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Priority conversion timer trigger selection bit </description>
            <name>PRTSL</name>
          </field>
        </fields>
        <name>PRTSL</name>
        <resetMask>0xF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x39</addressOffset>
        <description>Scan Conversion Timer Trigger Selection Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Scan conversion timer trigger selection bit </description>
            <name>SCTSL</name>
          </field>
        </fields>
        <name>SCTSL</name>
        <resetMask>0xF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x3C</addressOffset>
        <description>A/D Operation Enable Setup Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Basic cycle selection bit </description>
            <name>ENBLTIME</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>A/D operation enable state bit </description>
            <name>READY</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>A/D operation enable bit </description>
            <name>ENBL</name>
          </field>
        </fields>
        <name>ADCEN</name>
        <resetMask>0xFF03</resetMask>
        <resetValue>0xFF00</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x3</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40028000</baseAddress>
    <description>D/A Converter</description>
    <groupName>DAC</groupName>
    <interrupts></interrupts>
    <name>DAC</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>D/A Data Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit9 of DADR0</description>
            <name>DA9</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit8 of DADR0</description>
            <name>DA8</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit7 of DADR0</description>
            <name>DA7</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit6 of DADR0</description>
            <name>DA6</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit5 of DADR0</description>
            <name>DA5</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit4 of DADR0</description>
            <name>DA4</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit3 of DADR0</description>
            <name>DA3</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit2 of DADR0</description>
            <name>DA2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit1 of DADR0</description>
            <name>DA1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit0 of DADR0</description>
            <name>DA0</name>
          </field>
        </fields>
        <name>DADR0</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
