ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxL.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x3C</addressOffset>
        <description>IRQ10 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reception interrupt request on MFS ch.2</description>
            <name>MFSINT</name>
          </field>
        </fields>
        <name>IRQ10MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x40</addressOffset>
        <description>IRQ11 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status interrupt request on MFS ch.2</description>
            <name>MFSINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission interrupt request on MFS ch.2</description>
            <name>MFSINT0</name>
          </field>
        </fields>
        <name>IRQ11MON</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x44</addressOffset>
        <description>IRQ12 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reception interrupt request on MFS ch.3</description>
            <name>MFSINT</name>
          </field>
        </fields>
        <name>IRQ12MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x48</addressOffset>
        <description>IRQ13 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status interrupt request on MFS ch.3</description>
            <name>MFSINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission interrupt request on MFS ch.3</description>
            <name>MFSINT0</name>
          </field>
        </fields>
        <name>IRQ13MON</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x4C</addressOffset>
        <description>IRQ14 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reception interrupt request on MFS ch.4</description>
            <name>MFSINT</name>
          </field>
        </fields>
        <name>IRQ14MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x50</addressOffset>
        <description>IRQ15 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status interrupt request on MFS ch.4</description>
            <name>MFSINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission interrupt request on MFS ch.4</description>
            <name>MFSINT0</name>
          </field>
        </fields>
        <name>IRQ15MON</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x54</addressOffset>
        <description>IRQ16 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reception interrupt request on MFS ch.5</description>
            <name>MFSINT</name>
          </field>
        </fields>
        <name>IRQ16MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x58</addressOffset>
        <description>IRQ17 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status interrupt request on MFS ch.5</description>
            <name>MFSINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission interrupt request on MFS ch.5</description>
            <name>MFSINT0</name>
          </field>
        </fields>
        <name>IRQ17MON</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
