ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxL.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1C</addressOffset>
        <description>Display Data Memory Register 00</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 00</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM00</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1D</addressOffset>
        <description>Display Data Memory Register 01</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 01</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM01</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1E</addressOffset>
        <description>Display Data Memory Register 02</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 02</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM02</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1F</addressOffset>
        <description>Display Data Memory Register 03</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 03</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM03</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x20</addressOffset>
        <description>Display Data Memory Register 04</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 04</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM04</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x21</addressOffset>
        <description>Display Data Memory Register 05</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 05</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM05</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x22</addressOffset>
        <description>Display Data Memory Register 06</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 06</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM06</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x23</addressOffset>
        <description>Display Data Memory Register 07</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 07</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM07</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24</addressOffset>
        <description>Display Data Memory Register 08</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 08</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM08</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x25</addressOffset>
        <description>Display Data Memory Register 09</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Display Data 09</description>
            <name>LCDRAM</name>
          </field>
        </fields>
        <name>LCDRAM09</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
