ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxL.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x718</addressOffset>
        <description>Port Pseudo Open Drain Setting Register 6</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit0 of PZR6</description>
            <name>P0</name>
          </field>
        </fields>
        <name>PZR6</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x720</addressOffset>
        <description>Port Pseudo Open Drain Setting Register 8</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit2 of PZR8</description>
            <name>P2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bit1 of PZR8</description>
            <name>P1</name>
          </field>
        </fields>
        <name>PZR8</name>
        <resetMask>0x6</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x1</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40034000</baseAddress>
    <description>HDMI-CEC ch.0</description>
    <groupName>HDMICEC0</groupName>
    <interrupts>
      <interrupt>
        <name>HDMICEC0</name>
        <value>0x1E</value>
      </interrupt>
    </interrupts>
    <name>HDMICEC0</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>Transmission Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bus error detection interrupt enable bit</description>
            <name>IBREN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>transmission status interrupt enable bit </description>
            <name>ITSTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>EOM setting bit </description>
            <name>EOM</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>START setting bit</description>
            <name>START</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission operation enable bit</description>
            <name>TXEN</name>
          </field>
        </fields>
        <name>TXCTRL</name>
        <resetMask>0x3D</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Transmission Data Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Transmission Data</description>
            <name>TXDATA</name>
          </field>
        </fields>
        <name>TXDATA</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8</addressOffset>
        <description>Transmission Status Register </description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bus error detection interrupt request bit</description>
            <name>IBR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission status interrupt request bit </description>
            <name>ITST</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>ACK cycle value bit</description>
            <name>ACKSV</name>
          </field>
        </fields>
        <name>TXSTS</name>
        <resetMask>0x31</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>Signal Free Time Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Signal free time setting bits</description>
            <name>SFREE</name>
          </field>
        </fields>
        <name>SFREE</name>
        <resetMask>0xF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
