ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxL.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x61</addressOffset>
        <description>Data Bit Width Violation Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Maximum data bit width violation interrupt enable bit</description>
            <name>LELIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Minimum data bit width violation interrupt enable bit</description>
            <name>LESIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Maximum data bit width violation detection enable bit </description>
            <name>LELE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Minimum data bit width violation detection enable bit </description>
            <name>LESE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Error pulse output enable bit</description>
            <name>EPE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Maximum data bit width violation detection flag bit</description>
            <name>LEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Minimum data bit width violation detection flag bit</description>
            <name>LES</name>
          </field>
        </fields>
        <name>RCLE</name>
        <resetMask>0xFB</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x64</addressOffset>
        <description>Minimum Data Bit Width Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Minimum data bit width setting bits</description>
            <name>RCLESW</name>
          </field>
        </fields>
        <name>RCLESW</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x65</addressOffset>
        <description>Maximum Data Bit Width Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Maximum data bit width setting bits</description>
            <name>RCLELW</name>
          </field>
        </fields>
        <name>RCLELW</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x1</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40034100</baseAddress>
    <derivedFrom>HDMICEC0</derivedFrom>
    <description>HDMI-CEC ch.0</description>
    <groupName>HDMICEC0</groupName>
    <interrupts>
      <interrupt>
        <name>HDMICEC1</name>
        <value>0x1F</value>
      </interrupt>
    </interrupts>
    <name>HDMICEC1</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>Transmission Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bus error detection interrupt enable bit</description>
            <name>IBREN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>transmission status interrupt enable bit </description>
            <name>ITSTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>EOM setting bit </description>
            <name>EOM</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>START setting bit</description>
            <name>START</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission operation enable bit</description>
            <name>TXEN</name>
          </field>
        </fields>
        <name>TXCTRL</name>
        <resetMask>0x3D</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
